users/app/views/orders/_form.html.erb

SELECT "orders".* FROM "orders" WHERE (user_id = 1)
---
      <%= f.label :payment_type, 'Payment Type' %>
      <%= f.select :payment_type, Order.payment_types.keys %>

SELECT  "services".* FROM "services" ORDER BY "services"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
      <%= f.label :service, 'Service Type' %>
      <%= f.collection_select :service_id, Service.all, :id, :service_type %>