users/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE (user_id = 2) ORDER BY "orders"."id" DESC
SELECT "orders".* FROM "orders"
---
  def index
    @orders = Order.where("user_id = ?", session[:user_id])
    @all_orders = Order.all

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("origin", "destination", "payment_type", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["origin", "Jakarta Kota"], ["destination", "Depok"], ["payment_type", "cash"], ["created_at", "2017-12-12 11:06:49.876022"], ["updated_at", "2017-12-12 11:06:49.876022"], ["user_id", 1]]
UPDATE "orders" SET "updated_at" = $1, "state" = $2, "driver_id" = $3, "driver_name" = $4 WHERE "orders"."id" = $5  [["updated_at", "2017-12-19 08:24:23.557397"], ["state", "Completed"], ["driver_id", 1], ["driver_name", "Supir Motor"], ["id", 1]]
---
  def create
    @order = Order.new(order_params)
    @order.user = User.find(session[:user_id])

    @order.distance = @order.get_distance
    @order.price = @order.calculate_price

    respond_to do |format|
      if @order.save

UPDATE "orders" SET "state" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["state", "Cancelled"], ["updated_at", "2017-12-20 14:29:02.254157"], ["id", 1]]
---
  def cancel
    @order.state = "Cancelled"
    @order.save