users/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(phone: params[:phone])
---
SELECT  "users".* FROM "users" WHERE "users"."phone" = $1 LIMIT $2  [["phone", "021"], ["LIMIT", 1]]