users/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @users = User.where("id = ?", session[:user_id])

INSERT INTO "users" ("fullname", "phone", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "fullname" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["fullname", "Nanda"], ["password_digest", "$2a$10$Nhq84qcLRolEyzsjS.RUBe14kst3MjtvEO9xPrMsUvXbSy3y0ulpq"], ["updated_at", "2017-12-11 03:19:58.325227"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(session[:user_id])