drivers/app/controllers/drivers_controller.rb

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @drivers = Driver.where("id = ?", session[:driver_id])

INSERT INTO "drivers" ("fullname", "phone", "email", "password_digest", "created_at", "updated_at", "service_type") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @driver = Driver.new(driver_params)

    respond_to do |format|
      if @driver.save

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_driver
      @driver = Driver.find(session[:driver_id])