drivers/app/controllers/fleets_controller.rb

  def index
    @fleets = Fleet.all
---
SELECT "fleets".* FROM "fleets"

    def set_fleet
      @fleet = Fleet.find(params[:id])
---
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]