drivers/app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT "orders".* FROM "orders" WHERE (user_id = 2) ORDER BY "orders"."id" DESC