drivers/app/controllers/sessions_controller.rb

  def create
    driver = Driver.find_by(phone: params[:phone])
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."phone" = $1 LIMIT $2  [["phone", "123456789012"], ["LIMIT", 1]]